# Домашнее задание 1 (5 баллов).

Все задания ниже имеют равный вес (5/16).

In [1]:
import pandas as pd

#### Описание данных

В папке Data находится информация о студентах. Всего 10 групп студентов. Файлы делятся на две категории:
    * Students_info_i - информация о студентах из группы i
    * Students_marks_i - оценки студентов из группы i за экзамены

### Одно из важных достоинств pandas $-$ это удобные методы реляционного взаимодействия с данными, аналогичные, например, возможностям SQL для слияния и конкатенации таблиц: merge, join, concat. Наличие готовых методов позволяет не реализовывать самостоятельно поэлементную обработку данных и оперировать сразу целыми таблицами данных.

Подробно об этих методах посмотрите тут: https://www.kaggle.com/residentmario/renaming-and-combining#Combining

#### Задание 1. Соберите всю информацию о студентах в одну таблицу df. В получившейся таблице должна быть информация и оценки всех студентов из всех групп. Напечатайте несколько строк таблицы для демонстрации результата.¶

In [2]:
#your code here
allInfoFiles = ["https://raw.githubusercontent.com/TyurinIvan/iad2021/master/hw1/Data/Students_info_0.csv",
                "https://raw.githubusercontent.com/TyurinIvan/iad2021/master/hw1/Data/Students_info_1.csv",
                "https://raw.githubusercontent.com/TyurinIvan/iad2021/master/hw1/Data/Students_info_2.csv",
                "https://raw.githubusercontent.com/TyurinIvan/iad2021/master/hw1/Data/Students_info_3.csv",
                "https://raw.githubusercontent.com/TyurinIvan/iad2021/master/hw1/Data/Students_info_4.csv",
                "https://raw.githubusercontent.com/TyurinIvan/iad2021/master/hw1/Data/Students_info_5.csv",
                "https://raw.githubusercontent.com/TyurinIvan/iad2021/master/hw1/Data/Students_info_6.csv",
                "https://raw.githubusercontent.com/TyurinIvan/iad2021/master/hw1/Data/Students_info_7.csv",
                "https://raw.githubusercontent.com/TyurinIvan/iad2021/master/hw1/Data/Students_info_8.csv",
                "https://raw.githubusercontent.com/TyurinIvan/iad2021/master/hw1/Data/Students_info_9.csv"]

allMarksFiles = ["https://raw.githubusercontent.com/TyurinIvan/iad2021/master/hw1/Data/Students_marks_0.csv",
                "https://raw.githubusercontent.com/TyurinIvan/iad2021/master/hw1/Data/Students_marks_1.csv",
                "https://raw.githubusercontent.com/TyurinIvan/iad2021/master/hw1/Data/Students_marks_2.csv",
                "https://raw.githubusercontent.com/TyurinIvan/iad2021/master/hw1/Data/Students_marks_3.csv",
                "https://raw.githubusercontent.com/TyurinIvan/iad2021/master/hw1/Data/Students_marks_4.csv",
                "https://raw.githubusercontent.com/TyurinIvan/iad2021/master/hw1/Data/Students_marks_5.csv",
                "https://raw.githubusercontent.com/TyurinIvan/iad2021/master/hw1/Data/Students_marks_6.csv",
                "https://raw.githubusercontent.com/TyurinIvan/iad2021/master/hw1/Data/Students_marks_7.csv",
                "https://raw.githubusercontent.com/TyurinIvan/iad2021/master/hw1/Data/Students_marks_8.csv",
                "https://raw.githubusercontent.com/TyurinIvan/iad2021/master/hw1/Data/Students_marks_9.csv"]


list_ = []
for _file in range(len(allInfoFiles)):
  
  df1 = pd.read_csv(allInfoFiles[_file], index_col=None, header=0, sep=",")
  df2 = pd.read_csv(allMarksFiles[_file], index_col=None, header=0, sep=",")
  
  df = pd.merge(df1, df2, on=["index"])
  list_.append(df)
df = pd.concat(list_)


df

    index  gender race/ethnicity  ... math score reading score writing score
0       0  female        group B  ...         72            72            74
1       1  female        group C  ...         69            90            88
2       2  female        group B  ...         90            95            93
3       3    male        group A  ...         47            57            44
4       4    male        group C  ...         76            78            75
..    ...     ...            ...  ...        ...           ...           ...
95    995  female        group E  ...         88            99            95
96    996    male        group C  ...         62            55            55
97    997  female        group C  ...         59            71            65
98    998  female        group D  ...         68            78            77
99    999  female        group D  ...         77            86            86

[1000 rows x 10 columns]

#### Задание 2. Удалите столбец index у полученной таблицы. Напечатайте первые 10 строк таблицы.

In [3]:
#your code here
df = df.drop('index', axis=1)

df.head(10)

   gender race/ethnicity  ... reading score writing score
0  female        group B  ...            72            74
1  female        group C  ...            90            88
2  female        group B  ...            95            93
3    male        group A  ...            57            44
4    male        group C  ...            78            75
5  female        group B  ...            83            78
6  female        group B  ...            95            92
7    male        group B  ...            43            39
8    male        group D  ...            64            67
9  female        group B  ...            60            50

[10 rows x 9 columns]

#### Задание 3. Выведите на экран размеры полученной таблицы

In [4]:
# your code here
print('Количество яцеек: ', df.size)
print('Количество строк: ', df.shape[0])
print('Количество столбцов: ', df.shape[1])

Количество яцеек:  9000
Количество строк:  1000
Количество столбцов:  9

#### Задание 4. Выведите на экран статистические характеристики числовых столбцов таблицы (минимум, максимум, среднее значение, стандартное отклонение)

In [5]:
# your code here
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

#### Задание 5. Проверьте, есть ли в таблице пропущенные значения

Вот тут не понятно, что подразумевается под пропущенным значением: NaN, Null или ''

In [6]:
# your code here
import numpy as np
[df.iloc[i,j] for i,j in zip(*np.where(pd.isnull(df)))]
#print(np.where(pd.isnull(df)))

[]

#### Задание 6. Выведите на экран средние баллы студентов по каждому предмету (math, reading, writing)

In [7]:
# your code here
print('Среднее math:    ', df['math score'].mean())
print('Среднее reading: ', df['reading score'].mean())
print('Среднее writing: ', df['writing score'].mean())

Среднее math:     66.089
Среднее reading:  69.169
Среднее writing:  68.054

**Задание 7. Как зависят оценки от того, проходил ли студент курс для подготовки к сдаче экзамена (test preparation course)? Выведите на экран для каждого предмета в отдельности средний балл студентов, проходивших курс для подготовки к экзамену и не проходивших курс.**

In [8]:
# your code here
df.groupby("test preparation course")['math score', 'reading score', 'writing score'].apply(lambda x: x.mean())

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.

                         math score  reading score  writing score
test preparation course
completed                 69.695531      73.893855      74.418994
none                      64.077882      66.534268      64.504673

**Задание 8. Выведите на экран все различные значения из столбца lunch.**

In [9]:
# your code here
for name in df['lunch'].unique():
  print(name)

standard
free/reduced

**Задание 9. Переименуйте колонку "parental level of education" в "education", а "test preparation course" в "test preparation" с помощью метода pandas rename**
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html

In [10]:
# your code here
df = df.rename(columns={"parental level of education": "education", "test preparation course": "test preparation"})

df

    gender race/ethnicity  ... reading score writing score
0   female        group B  ...            72            74
1   female        group C  ...            90            88
2   female        group B  ...            95            93
3     male        group A  ...            57            44
4     male        group C  ...            78            75
..     ...            ...  ...           ...           ...
95  female        group E  ...            99            95
96    male        group C  ...            55            55
97  female        group C  ...            71            65
98  female        group D  ...            78            77
99  female        group D  ...            86            86

[1000 rows x 9 columns]

**Зафиксируем минимальный балл для сдачи экзамена**

In [11]:
passmark = 50

**Задание 10. Ответьте на вопросы:**
    * Какая доля студентов сдала экзамен по математике (passmark >= 50)?
    * Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?
    * Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике?

In [12]:
# your code here

counterFunc = df.apply(
    lambda x: True if x['math score'] >= 50 else False , axis=1)

numOfRows = len(counterFunc[counterFunc == True].index) 
print('Какая доля студентов сдала экзамен по математике (passmark >= 50)?                            ',
      numOfRows / df.shape[0])


counterFunc = df.apply(
    lambda x: True if (x['math score'] >= 50 and 
                       x['test preparation'] == 'completed') else False , axis=1)
counterFunc2 = df.apply(
    lambda x: True if x['test preparation'] == 'completed' else False , axis=1)


numOfRows = len(counterFunc[counterFunc == True].index)
numOfRows2 = len(counterFunc2[counterFunc2 == True].index)

print('Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?    ',
      numOfRows / numOfRows2)


counterFunc = df.apply(
    lambda x: True if (x['math score'] <= 50 and 
                       x['test preparation'] != 'completed' and 
                       x['gender'] == 'female') else False , axis=1)
counterFunc2 = df.apply(
    lambda x: True if (x['test preparation'] != 'completed' and 
                      x['gender'] == 'female') else False , axis=1)


numOfRows = len(counterFunc[counterFunc == True].index)
numOfRows2 = len(counterFunc2[counterFunc2 == True].index)

print('Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике? ',
      numOfRows / numOfRows2)

Какая доля студентов сдала экзамен по математике (passmark >= 50)?                             0.865
Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?     0.9217877094972067
Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике?  0.23353293413173654

**Задание 11. С помощью groupby выполните задания ниже. Также выведите время выполнения каждого из заданий.**
    * Для каждой этнической группы выведите средний балл за экзамен по чтению
    * Для каждого уровня образования выведите минимальный балл за экзамен по письму

In [37]:
# your code here
print('Часть 1: ', '\n',
      df.groupby("race/ethnicity")['reading score'].mean())

Часть 1:
 race/ethnicity
group A    64.674157
group B    67.352632
group C    69.103448
group D    70.030534
group E    73.028571
Name: reading score, dtype: float64

In [38]:
timeit (df.groupby("race/ethnicity")['reading score'].mean())

1000 loops, best of 3: 977 µs per loop

In [39]:
# your code here
print('Часть 2: ', '\n',
      df.groupby("education")['writing score'].min())

Часть 2:
 education
associate's degree    35
bachelor's degree     38
high school           15
master's degree       46
some college          19
some high school      10
Name: writing score, dtype: int64

In [41]:
timeit (df.groupby("education")['writing score'].min())

1000 loops, best of 3: 860 µs per loop

**Задание 12. Выполните задание 11 с помощью циклов. Сравните время выполнения.**

In [16]:
# your code here

**Задание 13. Выведите на экран средние баллы студентов по каждому предмету в зависимости от пола и уровня образования. То есть должно получиться количество групп, равных 2 * (число уровней образования), и для каждой такой группы выыведите средний балл по каждому из предметов.**

Это можно сделать с помощью сводных таблиц (pivot_table):

https://www.kaggle.com/kamilpolak/tutorial-how-to-use-pivot-table-in-pandas

In [17]:
# your code here
grouped = pd.pivot_table(data=df,index=['gender', 'education'])
#print(grouped)


grouped['avg score'] = (grouped['math score'] + 
                       grouped['reading score'] + 
                       grouped['writing score']) / 3 

print(grouped)

                           math score  reading score  writing score  avg score
gender education
female associate's degree   65.250000      74.120690      74.000000  71.123563
       bachelor's degree    68.349206      77.285714      78.380952  74.671958
       high school          59.351064      68.202128      66.691489  64.748227
       master's degree      66.500000      76.805556      77.638889  73.648148
       some college         65.406780      73.550847      74.050847  71.002825
       some high school     59.296703      69.109890      68.285714  65.564103
male   associate's degree   70.764151      67.433962      65.405660  67.867925
       bachelor's degree    70.581818      68.090909      67.654545  68.775758
       high school          64.705882      61.480392      58.539216  61.575163
       master's degree      74.826087      73.130435      72.608696  73.521739
       some college         69.009259      64.990741      63.148148  65.716049
       some high school     67.840909      64.693182      61.375000  64.636364

#### Задание 14. Сколько студентов успешно сдали экзамен по математике?

Создайте новый столбец в таблице df под названием Math_PassStatus и запишите в него F, если студент не сдал экзамен по математике (балл за экзамен < passmark), и P иначе.

Посчитайте количество студентов, сдавших и не сдавших экзамен по математике.

Сделайте аналогичные шаги для экзаменов по чтению и письму.

In [18]:
# your code here
counterFuncMath = df.apply(
    lambda x: 'P' if x['math score'] >= 50 else 'F' , axis=1)
counterFuncReading = df.apply(
    lambda x: 'P' if x['reading score'] >= 50 else 'F' , axis=1)
counterFuncWriting = df.apply(
    lambda x: 'P' if x['writing score'] >= 50 else 'F' , axis=1)

df['Math_PassStatus'] = counterFuncMath
df['Reading_PassStatus'] = counterFuncReading
df['Writing_PassStatus'] = counterFuncWriting

df.head(5)

   gender race/ethnicity  ... Reading_PassStatus Writing_PassStatus
0  female        group B  ...                  P                  P
1  female        group C  ...                  P                  P
2  female        group B  ...                  P                  P
3    male        group A  ...                  P                  F
4    male        group C  ...                  P                  P

[5 rows x 12 columns]

In [24]:
counterFuncMath = df.apply(
    lambda x: True if x['Math_PassStatus'] == 'P' else False , axis=1)
counterFuncReading = df.apply(
    lambda x: True if x['Reading_PassStatus'] == 'P' else False , axis=1)
counterFuncWriting = df.apply(
    lambda x: True if x['Writing_PassStatus'] == 'P' else False , axis=1)

numOfRowsMath = len(counterFuncMath[counterFuncMath == True].index)
numOfRowsReading = len(counterFuncReading[counterFuncReading == True].index)
numOfRowsWriting = len(counterFuncWriting[counterFuncWriting == True].index)


print('Сдало математику: ', numOfRowsMath,    'студентов. Не сдало:', len(df.index) - numOfRowsMath)
print('Сдало чтение:     ', numOfRowsReading, 'студентов. Не сдало:', len(df.index) - numOfRowsReading)
print('Сдало письмо:     ', numOfRowsWriting, 'студентов. Не сдало:', len(df.index) - numOfRowsWriting)

Сдало математику:  865 студентов. Не сдало: 135
Сдало чтение:      910 студентов. Не сдало: 90
Сдало письмо:      886 студентов. Не сдало: 114

#### Задание 15. Сколько студентов успешно сдали все экзамены?

Создайте столбец OverAll_PassStatus и запишите в него для каждого студента 'F', если студент не сдал хотя бы один из трех экзаменов, а иначе 'P'.

Посчитайте количество студентов, которые сдали все экзамены.

In [27]:
# your code here
counterFunc = df.apply(
    lambda x: 'P' if (x['Math_PassStatus'] == 'P' and
                      x['Reading_PassStatus'] == 'P' and
                      x['Writing_PassStatus'] == 'P'    ) else 'F' , axis=1)

df['OverAll_PassStatus'] = counterFunc

df.head(3)

   gender race/ethnicity  ... Writing_PassStatus OverAll_PassStatus
0  female        group B  ...                  P                  P
1  female        group C  ...                  P                  P
2  female        group B  ...                  P                  P

[3 rows x 13 columns]

In [28]:
counterFuncMath = df.apply(
    lambda x: True if x['OverAll_PassStatus'] == 'P' else False , axis=1)


numOfRowsWriting = len(counterFuncWriting[counterFuncWriting == True].index)

print('Все предметы сдало: ', numOfRowsWriting, 'студентов. Не сдало:', len(df.index) - numOfRowsWriting)

Все предметы сдало:  886 студентов. Не сдало: 114

#### Задание 16. Переведем баллы в оценки

### Система перевода баллов в оценки
####    больше 90 = A
####      80-90 = B
####      70-80 = C
####      60-70 = D
####      50-60 = E
####    меньше 50 = F (Fail)

Создайте вспомогательную функцию, которая будет по среднему баллу за три экзамена выставлять оценку студенту по данным выше критериям.

Создайте столбец Grade и запишите в него оценку каждого студента.

Выведите количество студентов, получивших каждую из оценок.

In [36]:
def GetGrade(average_mark):
    # your code here
    if average_mark >= 90:
      return 'A'
    elif average_mark >= 80:
      return 'B'
    elif average_mark >= 70:
      return 'C'
    elif average_mark >= 60:
      return 'D'
    elif average_mark >= 50:
      return 'E'
    else:
      return 'F'


# your code here

counterFunc = df.apply(
    lambda x: GetGrade((x['math score']    +
                        x['reading score'] +
                        x['writing score']  ) / 3) if True else 0, axis=1)


df['Grade'] = counterFunc

df.head(3)

   gender race/ethnicity  ... OverAll_PassStatus Grade
0  female        group B  ...                  P     C
1  female        group C  ...                  P     B
2  female        group B  ...                  P     A

[3 rows x 14 columns]